import random
def name():
    a= list(input('ваше имя: \n'))
    p = int(input('Укажите ваш пол( 1 - женский, 2 - мужской ): \n'))
    wends=['лини','али','ит','ин','ен','ис','ан','т','ик','ли','да','на','ва','та','ка','фа','ния','жа','са']
    mends=['тини','кини','гек','бек','рек','пер','тор','мар','де','то','вод','зор','дуб','мо']
    Sogl=['К','Н','Г','З','Х','В','П','Р','Л','Д','С','М','Т','Б','к','н','г','з','х','в','п','л','д','с','м','т','б']
    gl = ['а','е','и','ё','у','ы','о','э','я','ю','Ё','Е','У','О','Ы','А','Э','Я','И', 'Ю']
    ok = ['а','я']
    ngl=[]
    for i in range(len(a)):
        for b in range(len(gl)):
            if a[i]==gl[b]:
                ngl.append(a[i])
    word=[]
    b=''
    for i in range(len(ngl)):
        word.append(random.choice(Sogl))
        word.append(ngl[i])
    
    for i in range(len(word)):
        if i==0:
            b+=word[i].upper()
        elif i !=0:
            b+=word[i].lower()
    if p == 2:
        b+=random.choice(mends)
    if p == 1:
        b+=random.choice(wends)
        b+=random.choice(ok)
    print('Ваше имя - ', b)
def foo():
    n = True
    while n:
        arg = int(input('1 - сгенерировать имя, 2 - показать список разработчиков\n'))
        if arg == 1:
            name()
        else:
            print('\nСилков Александр Максимович - 1 Разработчик алгоритма преобразования слова\nСтепанов Михаил Сергеевич - 2 Разработчик связей между функциями\nХузеев Кирилл Юрьевич - главный тестировщик\nПирогов Егор Максимович - тестеровщик\nСеменов Алексей Павлович - тестировщик\nЭков Илья Андреевич - математик, тестер\nСкачкаускас Матвей Александрович - математик, тестер\n')
        new = int(input('запустить программу еще раз?\n(1 - да, 2 - нет)\n'))
        if new == 1:
            n = True
        else:
            n = False
            print('ок, до свидания!')
print('Привет, это программа предназначена для генерации случайных имён.')
if __name__ == '__main__':
    foo()
